import React from "react";
import HeaderWhite from '../Header/HeaderWhite';
import Footer from "../Footer/Footer";
import HeaderMobile from '../Header/HeaderMobile';
import './Delivery.css'



const Delivery = () => {

    return(

        <div className="delivery">
            <div className='content-padding'>
                <HeaderWhite/>
                <HeaderMobile/>
                <div className="delivery-content">
                <div className="pay-data"> 
                    <h2>
                        Оплата за товар
                    </h2>
                    <div className="pay-data-info">
                    <h3>Часткова оплата</h3>
                    <p>Ця опція створена з метою забезпечення того, що ваш товар буде успішно доставлений. Ціна часткової оплати включає в себе вартість доставки у дві сторони, забезпечуючи безперешкодний процес. Будь ласка, зверніть увагу, що передоплата не підлягає поверненню в разі, якщо покупець не з'явився для отримання посилки або відмовився від неї</p>
                    <h3>Повна оплата</h3>
                    <p>При повній оплаті вашого замовлення на суму від 600 грн, доставка здійснюється безкоштовно. Це вигідна можливість забезпечити безперешкодне отримання вашого товару за найвигідніших умов.</p>

                    </div>
                </div>
                <div className="delivery-data">
                    <h2>
                        Послуги доставки
                    </h2>
                    <h3>Ми здійсюємо відправку за використанням послуг "Нова Пошта" та "Укр пошта"</h3>
                    <p  className="delivery-data-red">"Будь ласка, зверніть увагу, що у випадку відправлення товару за допомогою "Укрпошти", існує ризик пошкодження товару, особливо якщо в вашому замовленні присутні бомбочки для ванни. Так як "Укрпошта" не використовує на своїх посилках інформаційні стікери "Крихке", ми рекомендуємо вам обирати доставку за допомогою "Нової Пошти" для забезпечення безпеки вашого товару.</p>
                </div>


                </div>
                <Footer/>
            </div>
        </div>

    )

}

export default Delivery;